{
    "outcomes":
    [
        "Perform two more Wild Magic Surges immediately.",
        "Perform three more Wild Magic Surges immediately.",
        "You cast Magic Missile as a 1d4th level spell.",
        "You cast Magic Missile as a 2d4th level spell.",
        "You cast Detect Thoughts.",
        "You cast Gust of Wind as a 2nd level spell.",
        "You cast Haste on yourself.",
        "You cast Shatter as a 2nd level spell.",
        "You can teleport up to 60ft to an unoccupied space you can see.",
        "A powerful force emits from you. All creatures within 15ft must succeed a Dexterity saving throw or be pushed 25ft away from you.",
        "You cast Firebolt on yourself and up to two other creatures.",
        "You cast Dissonant Whispers on yourself.",
        "You cast Blur on yourself.",
        "For 4 turns, you can teleport up to 20ft as a bonus action.",
        "You cast Ray of Frost on yourself.",
        "You cast Fireball as a third level spell centered on yourself, as if effected by the Careful Spell metamagic.",
        "You cast Blink.",
        "You cast Timestop. After its effect ends, you cast Finger of Death on yourself.",
        "For 1 minute, your height changes by 1d6ft (grow on even, shrink on odd).",
        "Your target becomes cocooned in crystal. They must succeed a Strength check (DC 15) to break out, or have someone perform the same Strength check to break them out.",
        "Your target is transported to the Ethereal Plane for 3 turns.",
        "A swarm of rats appear, which carry you 30ft in a random direction.",
        "You cast Grease centered on yourself.",
        "You become vibrantly blue. This can be undone with a spell that removes curses.",
        "Until long rest, you are only able to speak to animals.",
        "You grow another eye, gaining advantage on Perception for 1 minute.",
        "You are transported to the Astral Plane until the end of the next round.",
        "Cabbages abundantly sprout around you within a 30ft radius.",
        "1d6 flumphs appear within a 60ft radius around you. They're all scared.",
        "Your casted spell ricochets off the target to a random creature within 30ft of them.",
        "You cast Levitate on yourself.",
        "Until long rest, you can no longer speak. Instead, you emit pink bubbles when attempting to speak.",
        "All unlocked doors and windows within 60ft of you forcefully open.",
        "A confused bear appears within a 60ft radius of you for 1 minute.",
        "A confused gorilla appears within a 60ft radius of you for 1 minute.",
        "Your voice becomes 4x louder and you can only shout for 1 minute.",
        "You cast Fog Cloud centered on yourself.",
        "For the next five minutes, you can only breathe underwater.",
        "If the target dies to your attack, they explode violently. Otherwise, reroll Wild Magic Surge.",
        "Everyone within 30ft of you, including yourself, becomes invisible for 1 minute. Invisibility is broken on attack/cast.",
        "You glow brightly for 1 minute, blinding others within 5ft of you.",
        "You cast Mirror Image.",
        "Your arms become tentacles for 1 minute.",
        "All light sources within a 60ft radius extinguish.",
        "Until long rest, you become frightened of a random color.",
        "You shoot forth 2d4 non-poisonous snakes from your fingertips. They are not aggressive.",
        "If your current cast is a concentration, it cannot be cancelled by will. If it is not a concentration, reroll Wild Magic Surge.",
        "You cast Fear on all creatures except yourself within a 60ft radius.",
        "A stream of 1d100 small gems start shooting from both of your palms, which can target any creature 30ft away. That creature must make a Dexterity saving throw, or take 1 damage for every 5 gems they're hit by. Each gem is worth 1gp.",
        "A deafening bang emits from you, which can be heard by everyone within a 60ft radius. All within the radius, including yourself, must make a Constitution saving throw, or become stunned for 1d4 turns.",
        "Your spell appears to fail upon cast, but occurs 2 turns later.",
        "Your spell appears to fail upon cast, but occurs 3 turns later.",
        "Everyone within 20ft of you is healed for 2d10 hit points.",
        "A Beholder appears in front of your target.",
        "An anvil appears above your target and falls. The target must make a Dexterity saving throw (DC 15), or take 2d20 damage.",
        "All spellcasters within a 120ft radius of you, including yourself, become terrified of casting spells. They must succeed a Wisdom saving throw (DC 21) in order to cast spells again.",
        "Make a Wisdom saving throw. On fail, you believe you are covered in flesh-eating insects for 1d4 turns, and are unable to do anything until it ends.",
        "Your spell affects a random target within 120ft of you.",
        "You transform into a marble statue of yourself for 1d4 turns, during which time you are considered petrified.",
        "You transform into a stuffed toy resembling yourself for 1d4 turns, during which time you are considered petrified.",
        "You transform into an iron statue of yourself for 1d4 turns, during which time you are considered petrified.",
        "You lose the ability to smell. The sense can be restored with a spell that removes curses.",
        "You lose the ability to hear. The sense can be restored with a spell that removes curses.",
        "Make a Wisdom saving throw against your spell save DC. On fail, you cast polymorph on yourself and become a cat for 6 turns.",
        "Make a Wisdom saving throw against your spell save DC. On fail, you cast polymorph on yourself and become a giant spider for 6 turns.",
        "All allies you have line of sight with have their speed halved and their jump height tripled for 1 minute.",
        "A 30-foot cube hypnotic pattern appears with you at the center. All creatures within the pattern must succeed a Wisdom saving throw, or fall asleep for 1 minute.",
        "You are surrounded by a horrible noxious odor for 1d6 turns. Anyone within 10ft of you must make a Constitution saving throw or become stunned.",
        "All of your clothing and equipment teleports to a random space 15ft away.",
        "Your eyes glow red for 1 minute.",
        "You feel extremely nauseated. Make a Constitution saving throw against your spell save DC. On fail, you must spend your next action throwing up.",
        "You are immediately flung towards a creature of your choice within 60ft that you have line of sight with. They must succeed a Dexterity saving throw (DC 15) or take damage equal to your weight divided by 20, rounded to the nearest integer."
    ]
}