{"abrosexual":{"description":"Sexual identity of people whose sexuality is fluid. For example, someone who is abrosexual could be asexual, pansexual, or bisexual.","colors":"The flag was created by a tumblr user named Mod Chad after another anonymous person requested it. The anonymous user said, \"could you guys possibly make an abrosexual pride flag?? maybe something along the lines of the typical five color flags that fades from #46D294 to white to #EE1766.\" It is unknown why this person chose these colors specifically.","peopleCount":2},"agender":{"description":"Gender identity of someone who does not identify as any gender.","colors":"According to The Gender Wiki's Pride Flag Page: \"Both black and white represent the complete absence of gender. Grey represents being semi-genderless. Green represents nonbinary gender, because it is the inverse of purple.\" It was created by a tumblr user with the screen name transrants in 2014.","peopleCount":4},"allosexual":{"description":"Sexual identity of someone who experiences sexual attraction; the opposite of asexual.","colors":"Up for interpretation.","peopleCount":2},"androsexual":{"description":"Sexual identity of someone who is attracted to masculinity.","colors":"Up for interpretation."},"apothisexual":{"description":"Sexual identity of someone who does not experience sexual attraction, and also finds sex significantly unappealing.","colors":"Up for interpretation.","peopleCount":1},"aromantic":{"description":"Romantic identity of someone who experiences no romantic attraction to others.","colors":"Dark Green: Represents aromanticism. Light Green: Represents the aromantic spectrum. White: Represents platonic and aesthetic attraction, as well as queer/quasi platonic relationships. Grey: Represents grey-aromantic and demiromantic people. Black: Represents the sexuality spectrum."},"asexual":{"description":"Sexual identity of someone who does not experience sexual attraction.","colors":"Black: Asexuality. Grey: Grey-asexuality and demi-sexuality. White: Non-asexual partners and allies. Purple: Community.","peopleCount":3},"bisexual":{"description":"Sexual identity of someone who is attracted to two genders (typically male and female).","colors":"Pink represents the attraction to females, blue represents the attraction to males, and purple represents the attraction to both. Another interpretation is simply that pink is one unspecified gender, blue is another unspecified gender, and purple is both.","peopleCount":5},"catgirl who spilled her orange juice":{"description":"for all the catgirls out there spilling their oranged juices","colors":"orange: orange juice. red: shurt. pink:catgirl","peopleCount":1},"ceterosexual":{"description":"Sexual identity of someone who is only attracted to people that identify as nonbinary (synonymous with skoliosexual).","colors":"Yellow represents being non-binary or attracted to non-binary people. Green represents bigender, third gender, genderqueer, or other genders. White and black represent neutral genderlessness, agender, questioning gender identity, etc. Lavender represents love outside the gender norms.","peopleCount":1},"chocolate bitch pride":{"description":"Secretly a weaponized cannoli, this flag stands for","colors":"Brown reperesensts chocolate","peopleCount":2},"completely normal photo of ross":{"description":"A completely normal photo of Ross Geller.","colors":"him","peopleCount":2},"cupiosexual":{"description":"Sexual identity of someone who does not experience sexual attraction, but still desires a sexual relationship.","colors":"Up for interpretation.","peopleCount":2},"demiboy":{"description":"Gender identity of someone who is only partly male.","colors":"Flag was created by a tumblr user with the screen name Transrants. According to Nonbinary.org's Demigender page, the colors mean: \"Blue: male. White: agender or nonbinary gender. Grey: partial.\""},"demigirl":{"description":"Gender identity of someone who is only partly female.","colors":"Flag was created by a tumblr user with the screen name Transrants.  According to Nonbinary.org's Demigender page, the colors mean: \"Pink: female. White: agender or nonbinary gender.  Grey: partial.\"","peopleCount":6},"demisexual":{"description":"Sexual identity of someone who does not experience sexual attraction until they form a strong emotional connection to someone.","colors":"Black represents asexuality. Grey represents Gray-Ace and demisexuality. White represents sexuality. Purple represents community.","peopleCount":1},"dumb bitch pride":{"description":"all of us","colors":"meaning","peopleCount":1},"gamer bernie sanders":{"description":"unknown...","colors":"unknown","peopleCount":3},"gay":{"description":"Sexual identity of someone who is attracted to people of the same sex/gender. Also used as a catch-all for the LGBTQA+ community (Lesbian, Gay, Bisexual, Transgender, Questioning/Queer, Asexual, and anything else that falls under LGBTQA+).","colors":"Red: Life. Orange: Healing. Yellow: Sunlight. Green: Nature. Blue: Harmony/Peace. Violet: Spirit.","peopleCount":2},"genderfluid":{"description":"Gender identity of someone whose gender is not fixed. For example, someone who is genderfluid could identify as male one day, nonbiniary another day, and so on.","colors":"Pink represents femininity. White represents all genders. Purple represents masculinity and femininity. Black represents genderlessness. Blue stands for masculinity.","peopleCount":5},"genderqueer":{"description":"Gender identity of someone whose gender does not fit within the male/female binary (synonymous with nonbinary).","colors":"Lavender: Mixture of “blue” and “pink”. Represents androgyny, and people who identify as a mixture of female and male. White: Represents agender people. Dark Chartreuse Green: The inverse of lavender. Represents people who identify outside of and without reference to the gender binary.","peopleCount":1},"graysexual":{"description":"Sexual identity of someone who sometimes experiences sexual attraction, and sometimes doesn't.","colors":"Created by Shikku27316 as a proposed flag. \"My original explanation was kinda dumb. The purple was asexuality, the white was allosexuality, and the grey was the region of \"getting over\" asexuality, and then \"getting over\" allosexuality to be asexual again, but that sounds pretty dumb, plus it's not the only definition of greysexual. So, the colours mean the same, but it's kinda symbolising the two coming together to make the grey area.\"","peopleCount":1},"intersex":{"description":"Someone who is born with physical sex characteristics that don’t fit the traditional definitions for male or female bodies.","colors":"Purple: Used because it’s seen as a gender neutral color. Yellow: Used because it’s seen as a gender neutral color. Circle: Represents wholeness, completeness, and the intersex people’s potentiality.","peopleCount":1},"lesbian":{"description":"Someone who identifies as a woman, and is attracted to women.","colors":",':^)"},"minecraft":{"description":"undefined","colors":"undefined","peopleCount":1},"nonbinary":{"description":"Gender identity of someone who does not fit within the male/female binary (synonymous with genderqueer).","colors":"Yellow is for gender without reference to the gender binary. White: those with many or all genders. Purple: a mix of female and male. Black: without gender.","peopleCount":5},"off the shits":{"description":"For when you're completely off the shits!","colors":"Deep Plum: Represents going absolutely hog wild at all times. Red: Represents insatiable blood lust. Yellowish Green: Represents being a fucking menace with no critical thinking skills.","peopleCount":4},"omnisexual":{"description":"Sexual identity of someone who can be attracted to any gender. Unlike pansexuals, omnisexuals still care about the gender their partner identifies as.","colors":"Up for interpretation.","peopleCount":2},"pansexual":{"description":"Sexual identity of someone who can be attracted to any gender. Unlike omnisexuals, pansexuals are described as \"gender-blind\", in that they do not care about the gender of their partner.","colors":"Pink: Representing attraction to those who identify as female. Yellow: Representing attraction to those who identify as genderqueer, non-binary, agender, androgynous, or anyone who doesn’t identify on the male-female binary. Blue: Representing attraction to those who identify as male."},"parasexual":{"description":"Sexual identity of someone who does not experience sexual attraction, but still enjoys recreational sex.","colors":"Up for interpretation.","peopleCount":5},"polyamory":{"description":"The practice of engaging in multiple sexual relationships with the consent of all people involved.","colors":"Blue represents openness and honesty between all lovers involved in each relationship. Red represents love and passion. Black represents all people in open and consensual relationships who have to hide their relationships due to social discrimination. The golden pi represents the value placed on emotional attachments to others.","peopleCount":2},"polysexual":{"description":"Sexual identity of someone who is attracted to multiple, but not all, genders.","colors":"Pink represents attraction to females. Blue represents attraction to males. Green (most likely) represents attraction to people with non-binary gender identities.","peopleCount":3},"rabiosexual":{"description":"Sexual identity of someone who is attracted to people with rabies.","colors":"it's a joke","peopleCount":2},"shit eating brain fungus":{"description":"Flag of the lads.","colors":"Blue: Michael. Green: Vincent. Neon yellow/neon green: Hazmat suit person cleaning up fungus. Orange: Kordell. Red: Bianca."},"transgender":{"description":"Gender identity of someone whose gender does not align with the sex they were assigned at birth.","colors":"Light Blue: Represents the traditional color for boys. Light Pink: Represents the traditional color for girls. White: Represents those who are intersex, transitioning, or see themselves as having a neutral or undefined gender.","peopleCount":1},"yee haw pride flag":{"description":"weesnaw","colors":"sipmson..."},"yogurt cat":{"description":"huuuuuurg","colors":"don't eat 'im","peopleCount":2}}